*** 2.3.9　扩展阅读：Linux的分区和挂载

在安装的过程中，有的同学对这个Linux系统的分区还是不大明白，因为跟Windows下的有些区别。没事，咱们仔细说说。

【你们住房子，我们住硬盘】
# 类比得好。
话说我们软件要想在一台电脑里定居，得有个住的地方，就好像你们人类要在一个城市里定居得有个住处一样。不过我们软件并不像人类一样，住在钢筋水泥的格子里面，我们住的地方，是一块叫做硬盘的空间。说起来我们住的这个硬盘空间，和你们人类住的这个房子是很相似的。那我们就拿您这房子来做对比，说说我们这个硬盘空间吧。

首先，你们人类的房子就是一大块能放东西的空间，是吧。有大有小，100平米的、200平米的、40平米的都有。里面放着洗衣机啊、电冰箱啊、床啊、桌子啊之类的各种东西。我们软件住的硬盘也是一大块能放东西的空间，大小也不一定，什么80GB的、200GB的、500GB的、一个TB的都有。里面存着文档、电影，各种程序，以及我这个操作系统等数据。
#+BEGIN_SRC shell :results output
lsblk
#+END_SRC

#+RESULTS:
: NAME                 MAJ:MIN RM   SIZE RO TYPE MOUNTPOINT
: loop0                  7:0    0  89.1M  1 loop /snap/core/7917
: loop1                  7:1    0  89.1M  1 loop /snap/core/8039
: sda                    8:0    0   113G  0 disk
: ├─sda1                 8:1    0   512M  0 part /boot/efi
: └─sda2                 8:2    0 112.5G  0 part
:   ├─vgkubuntu-root   253:0    0 111.6G  0 lvm  /
:   └─vgkubuntu-swap_1 253:1    0   980M  0 lvm  [SWAP]


你们的房子一般不会是一个整个的空间（毕竟那是要住人的，不是仓库），而是会被分割成几个小的空间，一间屋，一间屋的。我们的硬盘虽然也可以好几百GB整个用，可也不是很方便，一般也会被分割成几个小的空间，每个空间就叫一个分区，一个分区就好比你们那一间屋。

#+BEGIN_SRC shell :results output
fdisk -l
#+END_SRC

#+RESULTS:

【住房要有很多功能空间】

好，关于屋子和分区的事情暂时先放放，说说你们人类日常生活习性的问题。你们一般每天要吃3次饭，一般不愿意露天吃，是吧，需要有一个吃饭的地方。而且既然吃饭，就得有个做饭的地方，甭管是谁做，反正得加工一下，不像兔子似的路边上逮着块草地就能过去啃两口。一天3顿饭之后，得休息，需要有睡觉的地方，大桥底下也好，水床上面也罢，总得有个地方。那么刚才说的你那房子里，就有为满足你的各种需求而设计的各种功能空间。有放着床睡觉的地方；有摆着炉灶，锅碗瓢盆啥的地方，那是做饭的地儿；放个饭桌，这一看就知道，吃饭的地儿；放个马桶，那这就是厕所。
#+BEGIN_SRC shell :results output
df -hl
#+END_SRC

#+RESULTS:
#+begin_example
Filesystem                  Size  Used Avail Use% Mounted on
udev                        1.9G     0  1.9G   0% /dev
tmpfs                       385M  1.4M  384M   1% /run
/dev/mapper/vgkubuntu-root  110G   48G   57G  46% /
tmpfs                       1.9G  174M  1.8G  10% /dev/shm
tmpfs                       5.0M  4.0K  5.0M   1% /run/lock
tmpfs                       1.9G     0  1.9G   0% /sys/fs/cgroup
/dev/loop0                   90M   90M     0 100% /snap/core/7917
/dev/loop1                   90M   90M     0 100% /snap/core/8039
/dev/sda1                   511M  7.9M  504M   2% /boot/efi
tmpfs                       385M   16K  385M   1% /run/user/1000
#+end_example

那么我们Linux的硬盘里也有类似的情况（当然，我可不是说我们这也有厨房厕所啊）。我们Linux系统有着独特的目录结构，最基本的是一个根目录，我们喜欢叫它“/”，它就像您那整个一大间屋子。“/”目录下还有很多的目录，比如“/etc”，是用来存配置文件的；“/bin”是用来放二进制程序的；“/boot”是用来放启动文件的；“/lib”是用来放库文件的；还有“/home”是用来放用户的各种文件的。这一个个的目录，就好像你房里一个个的功能空间一样，各有各的用途。
# bin boot lib etc var
#+BEGIN_SRC shell :results output
ls /
#+END_SRC

#+RESULTS:
#+begin_example
bin
boot
cdrom
dev
etc
home
lib
lib32
lib64
libx32
lost+found
media
mnt
proc
root
run
sbin
snap
srv
sys
tmp
usr
var
#+end_example

【分区和目录的联系】

那么说了这么半天，又是分区，又是目录的，分区跟目录有什么关系呢？有人说了：“我知道，分区就是C盘，D盘，E盘这些，每个盘里再有各自的目录。”兄弟，我只能告诉你，你又OUT了。刚才我说了我们Linux的目录结构，就是一个“/”目录，下面有一些次级目录，每个次级目录下面再有子目录及子子目录......无论分区情况如何，这个目录结构是不会变的。那么分区怎么跟目录联系起来呢？联系就是，你可以指定任意一个目录里的东西存在某个分区里，如果不指定，则这个目录里的东西存在上一级目录所在分区中，如果上一级目录也没有特殊指定分区，则再上溯一级目录，依此类推。这么一直上溯，就一定会上溯到最上层的根目录“/”。所以，装系统的时候，其他的可以不指定，但一定要指定“/”目录存放在哪个分区。
#+BEGIN_SRC shell :results output
ls /lib
#+END_SRC

#+RESULTS:
#+begin_example
accountsservice
apparmor
apt
aspell
at-spi2-core
avahi
bfd-plugins
binfmt.d
binfmt-support
bluetooth
bolt
calibre
cantata
cnf-update-db
colord
command-not-found
compat-ld
console-setup
cpp
crda
cryptsetup
cups
dbus-1.0
dconf
debug
dkms
dpkg
eject
emacs
emacsen-common
encfs
environment.d
file
firefox
firefox-addons
firmware
fwupd
gcc
geoclue-2.0
ghostscript
girepository-1.0
git-core
gnupg
gnupg2
GNUstep
gold-ld
groff
grub
grub-legacy
hdparm
init
initramfs-tools
ispell
kauth
kernel
klibc
klibc-KzNL5rI0ooqhK-koTVzHy10DW4w.so
language-selector
lantern
libadplug-2.2.1.so.0
libadplug-2.2.1.so.0.0.0
libchm.so.1
libchm.so.1.0.0
libepub.so.0
libepub.so.0.2.1
libfreecell-solver.so.0
libfreecell-solver.so.0.6.0
libgnustep-base.so.1.26
libgnustep-base.so.1.26.0
libhardsid-builder.so.0
libhardsid-builder.so.0.0.1
libkolabxml.so.1
libkolabxml.so.1.1.6
libmbim
libnetpbm.so.10
libnetpbm.so.10.0
libpodofo.so.0.9.6
libqmi
libreoffice
libresid-builder.so.0
libresid-builder.so.0.0.1
libsidplay2.so.1
libsidplay2.so.1.0.1
linux
linux-boot-probes
linux-sound-base
locale
lp_solve
lsb
man-db
mecab
memtest86+
mime
modprobe.d
modules
modules-load.d
mozilla
mysql
netplan
networkd-dispatcher
NetworkManager
nodejs
nvidia
openssh
os-prober
os-probes
os-release
p7zip
packagekit
pcmciautils
phantomjs
pkgconfig
pkg-config.multiarch
pm-utils
policykit-1
pppd
pulse-13.0
python2.7
python3
python3.7
python3.8
qt5
recovery-mode
rsyslog
ruby
sasl2
sbcl
sftp-server
shim
simplescreenrecorder
snapd
software-properties
ssl
sudo
sysctl.d
syslinux
SYSLINUX
syslinux-legacy
systemd
sysusers.d
tc
terminfo
tmpfiles.d
ubiquity
ubuntu-advantage
ubuntu-release-upgrader
udev
udisks2
ufw
upower
valgrind
X11
x86_64-linux-gnu
xorg
xserver-xorg-video-intel
#+end_example

比如说，可以整个硬盘就一个分区，然后指定根目录“/”存在这个分区中。好，那么整个“/”目录，以及“/”目录下的各级子目录里面的所有东西，都存放在这个大分区里。我也可以分两个区，分区甲和分区乙。我指定“/”目录存在分区甲里面，然后指定“/home”目录存在分区乙里面。那么整个“/”目录，以及“/”目录下的，除了“/home”目录及其下各级子目录外，其他目录里面的所有东西，都存在分区甲。“/home”目录及其下各级子目录里的东西，存在分区乙。当然，也可以分80多个分区，给每一个目录都手动指定一个分区来存放东西------如果你吃得有点多的话。

这种分区和目录的关系，就像你房子里的房间和功能区之间的关系一样。可以为做饭的地方单独分出一间屋子来，叫做厨房。但是也可以是开放式厨房，厨房并不单独放在一间屋子中，而是和饭厅公用一间屋子。同理，可以为“/home”单独指定一个分区，但也可以不单独指定，而是存在“/”所在的分区中，作为“/”下的一级子目录，和“/”公用一个分区空间。是不是很像呢？

最后再说一点，给某一个目录指定分区的动作，有个专业术语，叫做“挂载”，以后还会经常提到。
# 分区是物理动作，比如插入硬盘。

